'''
Количество слов
Дана строка, состоящая из слов, разделённых пробелами.
Определите, сколько в ней слов. Используйте для решения задачи метод count.
'''
S = input()
print(S.count(' ')+1)
